package Session3;

class Example {
    double average;   // نتیجه میانگین اینجا ذخیره می‌شود
    static int g;

    void avg(int first, int second) {//دو عدد ورودی می‌گیرد.
        average = (first + second) / 2.0; // میانگین واقعی عملیات: دو عدد را جمع می‌کند و بر 2.0 تقسیم می‌کند.
    }//ذخیره‌سازی: نتیجه را در متغیر averageکه در بالا تعریف کرده بودیم، “بایگانی” یا ذخیره می‌کند.

    public static void main(String[] args) {
        Example obj = new Example();//اینجا ما یک کپی یا یک “شیء” از روی نقشه‌یScope1می‌سازیم و اسمش را می‌گذاریم objحالا این برای خودش یک متغیر averageخالی دارد

        obj.avg(10, 20); // فقط اجرا می‌شود و average را مقداردهی می‌کند

        System.out.println(obj.average); // این درست است (چون average متغیر است)

    }
}



//double average:تعریف شده تا بتواند اعداد اعشاری (مثل ۱۵.۵) را هم ذخیره کند.doubleجداگانه برای خودشان دارند. از نوعaverageندارد، متعلق به هر “شیء” است که از روی این کلاس ساخته می‌شود. یعنی اگر ۱۰ تا دانش‌آموز بسازیم، هر کدام یکstatic چون کلمه
//static int g: است، متعلق به خودِ کلاس است. یعنی فقط یک دانه از آن در کل برنامه وجود دارد و همه اشیاء در آن شریک هستند.staticچون
//void: یعنی این متد “دهنده” نیست. وقتی صدایش می‌زنید، کاری را انجام می‌دهد اما نتیجه را مستقیماً به شما “پس نمی‌دهد”.
//متد  void avgمثل یک کارمند است که به او می‌گویید: «این دو عدد را بگیر، میانگین‌شان را حساب کن و در آن پرونده(average)بنویس.»
//
//کارمند می‌رود، حساب می‌کند، در پرونده می‌نویسد و برمی‌گردد پیش شما، اما چیزی در دستش نیست که به شما بدهد(void).
//شما برای دیدن نتیجه، خودتان باید بروید و پرونده obj.averageرا باز کنید و بخوانید.

